// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
//
// if (friends.length >= 3) {
//     console.log('це великий масив, в якому  3 і більше елементи');
// } else {
//     console.log('це маленький масив, в якому менше 3-х елементів');
// }


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let num1, num2, num3;
//
// num1 = +prompt('Num1');
// num2 = +prompt('Num2');
// num3 = +prompt('Num3');
//
// if (num1 < num2 && num1 < num3) {
//     console.log('Число', num1);
// } else if (num2 < num1 && num2 < num3) {
//     console.log('Число', num2);
// } else if (num3 < num1 && num3 < num2) {
//     console.log('Число', num3);
// }else {
//     console.log('Введіть правильні дані');
// }

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//
// {
//     let a = 2;
//     let b = 1;
//
//     (a + b) < 4 ? console.log('Мало') : console.log('Багато');
// }
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//
// let a = +prompt('Введіть число від -100 , 0 , +100');
//
// a === 0 ? console.log('Число являється нулем') : a < 0 && a > -100 ?
//     console.log('негативним') : a > 0 && a < 100 ? console.log('Позитивним') : console.log('Неправильно введене число');
